In [206]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
hop = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(hop)

In [220]:
total_pur = len(hop_df["SN"].unique())
total_pur

576

In [219]:
# Creating a summary DataFrame using above values
summary_df = pd.DataFrame({"Number of Players":[total_pur]})

summary_df

   Number of Players
0                576

In [289]:
total_pid = len(hop_df["Purchase ID"].value_counts())
total_pid

780

In [251]:
# Calculate the number of unique authors in the DataFrame
itemname = len(hop_df["Item Name"].unique())
itemname

179

In [254]:
# The mean method averages the series
average = hop_df["Price"].mean()
average

3.0509871794871795

In [216]:
# The sum method adds every entry in the series
total = hop_df["Price"].sum()
total

2379.77

In [290]:
# Creating a summary DataFrame using above values
summary_df = pd.DataFrame({"Number of Unique Items": [itemname],
                           "Average Price": [average],
                           "Total Purchases":[total_pid],
                           "Total Revenue": [total]})

summary_df

   Number of Unique Items  Average Price  Total Purchases  Total Revenue
0                     179       3.050987              780        2379.77

In [319]:
ddf=hop_df.drop_duplicates(subset=["SN","Gender"],keep = "last")
ddf

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18,35-39
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,15-19
778,778,Sisur91,7,Male,92,Final Critic,4.19,<=10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [316]:
gcount = len(ddf.value_counts())
gcount

576

In [327]:
malec =  hop_df["Gender"].value_counts()["Male"]
malec

652

In [299]:
femalec = hop_df["Gender"].value_counts()["Female"]
femalec

113

In [13]:
otherc = hop_df["Gender"].value_counts()["Other / Non-Disclosed"]
otherc

15

In [226]:
summary_df = pd.DataFrame({"Total Male": [malec],
                           "Total Female": [femalec],
                           "Total Other/Non-Disclosed":[otherc],
                           "Total Players": [total_pur]})

summary_df

   Total Male  Total Female  Total Other/Non-Disclosed  Total Players
0         652           113                         15            576

In [17]:
summary_df2 = pd.DataFrame([{"Player Type": "Male", "Total Count": malec},
                            {"Player Type": "Female", "Total Count": femalec},
                            {"Player Type": "Other/Non-Disclosed", "Total Count":otherc}])

summary_df2

           Player Type  Total Count
0                 Male          652
1               Female          113
2  Other/Non-Disclosed           15

In [19]:
total_players = summary_df2["Total Count"].sum()
total_players

780

In [20]:
# Create a new column that finds the Total Male Percentages
summary_df2["Percentage of Players"] = summary_df2["Total Count"] / total_players
summary_df2

           Player Type  Total Count  Percentage of Players
0                 Male          652               0.835897
1               Female          113               0.144872
2  Other/Non-Disclosed           15               0.019231

In [314]:
# group by Team, get mean, min, and max value of Age for each value of Tea
totals_gender= hop_df.groupby("Gender").agg({"Price":["sum","mean","max","min"]})
totals_gender

                         Price
                           sum      mean   max   min count
Gender
Female                  361.94  3.203009  4.90  1.00   113
Male                   1967.64  3.017853  4.99  1.00   652
Other / Non-Disclosed    50.19  3.346000  4.75  1.33    15

In [105]:
matp=4.99
matp

4.99

In [106]:
fatp=4.90
fatp

4.9

In [107]:
oatp=4.75
oatp

4.75

In [81]:
pur_cm=malec
pur_cm

652

In [93]:
price_summ=1967.64
price_summ

1967.64

In [97]:
avgmp=price_summ/pur_cm
avgmp

3.0178527607361967

In [82]:
pur_cf=femalec
pur_cf

113

In [94]:
price_sumf=361.94
price_sumf

361.94

In [98]:
avgfp=price_sumf/pur_cf
avgfp

3.203008849557522

In [83]:
pur_co=otherc
pur_co

15

In [95]:
price_sumo=50.19
price_sumo

50.19

In [99]:
avgop=price_sumo/pur_co
avgop

3.3459999999999996

In [108]:
summarybygender_df = pd.DataFrame([{"Gender": "Male", "Total Count": pur_cm,"Average Purchase Price":avgmp,"Total Purchase Value":price_summ,"Avg Total Purchase Per Person":matp},
                            {"Gender": "Female", "Total Count": pur_cf,"Average Purchase Price":avgfp,"Total Purchase Value":price_sumf,"Avg Total Purchase Per Person":fatp},
                            {"Gender": "Other/Non-Disclosed", "Total Count":pur_co,"Average Purchase Price":avgop,"Total Purchase Value":price_sumo,"Avg Total Purchase Per Person":oatp}])

summarybygender_df

,Gender,Total Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase Per Person
0,Male,652,3.017853,1967.64,4.99
1,Female,113,3.203009,361.94,4.90
2,Other/Non-Disclosed,15,3.346000,50.19,4.75

In [111]:
# Read and display the CSV with Pandas
hop_df = purchase_data
hop_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [113]:
# group by Team, get mean, min, and max value of Age for each value of Tea
totals_gender= hop_df.groupby("Gender").agg({"Age":["mean","max","min"]})
totals_gender

                             Age
                            mean max min
Gender
Female                 21.345133  40   7
Male                   22.917178  45   7
Other / Non-Disclosed  24.200000  38  15

In [134]:
# Figure out the minimum and maximum views for a TED Talk
print(hop_df["Age"].max())
print(hop_df["Age"].min())

45
7

In [405]:
# Create the bins in which Data will be held
# Bins are 0, 59.9, 69.9, 79.9, 89.9, 100.   
bins = [9,10,15,20,24,25,30,35,40]

# Create the names for the five bins
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29","30-34","35-39","40+"]

In [406]:
# Slice the data and place it into bins
pd.cut(hop_df["Age"], bins, labels=group_labels).head()

0    15-19
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '40+']

In [407]:
# Place the data series into a new column inside of the DataFrame
hop_df["Age Group"] = pd.cut(hop_df["Age"], bins, labels=group_labels)
hop_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [408]:
# Create a GroupBy object based upon "View Group"
age_group = hop_df.groupby("Age Group")

# Find how many rows fall into each bin
c=(age_group["Age"].count())
print(c)

# Find how many rows fall into each bin
p=(age_group["Age"].count()/780)
print(p)

Age Group
<10        9
10-14     54
15-19    200
20-24    266
25-29     59
30-34     77
35-39     52
40+       33
Name: Age, dtype: int64
Age Group
<10      0.011538
10-14    0.069231
15-19    0.256410
20-24    0.341026
25-29    0.075641
30-34    0.098718
35-39    0.066667
40+      0.042308
Name: Age, dtype: float64

In [395]:
agedemo_df = pd.DataFrame({"Total Count":c,"Total Percentages":p*100})

agedemo_df

           Total Count  Total Percentages
Age Group
<10                 23           2.948718
10-14                9           1.153846
15-19               54           6.923077
20-24              200          25.641026
25-29              325          41.666667
30-34               77           9.871795
35-39               52           6.666667
40+                 33           4.230769

In [182]:
# Create a GroupBy object based upon "View Group"
age_group = hop_df.groupby("Age Group")

# Find how many rows fall into each bin
atp=(age_group["Age"].count())
print(atp)

# Get the average of each column within the GroupBy object
psum=age_group[["Price"]].sum()
print(psum)

# Get the average of each column within the GroupBy object
pavg=age_group[["Price"]].mean()
print(pavg)

Age Group
<=10      32
11-14     54
15-19    200
20-24    325
25-29     77
30-34     52
35-39     33
40+        7
Name: Age, dtype: int64
            Price
Age Group
<=10       108.96
11-14      156.60
15-19      621.56
20-24      981.64
25-29      221.42
30-34      155.71
35-39      112.35
40+         21.53
              Price
Age Group
<=10       3.405000
11-14      2.900000
15-19      3.107800
20-24      3.020431
25-29      2.875584
30-34      2.994423
35-39      3.404545
40+        3.075714

In [189]:
# Create the bins in which Data will be held
# Bins are 0, 59.9, 69.9, 79.9, 89.9, 100.   
pbins = [0, 10, 15, 20, 25, 30,35,40,45]

# Create the names for the five bins
group_cat = ["<=10", "11-14", "15-19", "20-24", "25-29","30-34","35-39","40+"]

In [190]:
# Slice the data and place it into bins
pd.cut(hop_df["Age"], pbins, labels=group_cat).head()

0    15-19
1    35-39
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): ['<=10' < '11-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '40+']

In [191]:
# Place the data series into a new column inside of the DataFrame
hop_df["Age Group"] = pd.cut(hop_df["Age"], pbins, labels=group_cat)
hop_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [192]:
# Place the data series into a new column inside of the DataFrame
hop_df["Age Group"] = pd.cut(hop_df["Age"], pbins, labels=group_cat)
hop_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [197]:
# Create a GroupBy object based upon "View Group"
age_group = hop_df.groupby("Age Group")

# Find how many rows fall into each bin
a=(age_group["Age"].count())
print(a)

# Find how many rows fall into each bin
admean=(age_group["Price"].mean())
print(admean)

# Find how many rows fall into each bin
d=(age_group["Price"].sum())
print(d)

Age Group
<=10      32
11-14     54
15-19    200
20-24    325
25-29     77
30-34     52
35-39     33
40+        7
Name: Age, dtype: int64
Age Group
<=10     3.405000
11-14    2.900000
15-19    3.107800
20-24    3.020431
25-29    2.875584
30-34    2.994423
35-39    3.404545
40+      3.075714
Name: Price, dtype: float64
Age Group
<=10     108.96
11-14    156.60
15-19    621.56
20-24    981.64
25-29    221.42
30-34    155.71
35-39    112.35
40+       21.53
Name: Price, dtype: float64

In [198]:
agedemo_df = pd.DataFrame({"Total Count":a,"Average Total Price":admean,"Total Purchase Value":d})

agedemo_df

           Total Count  Average Total Price  Total Purchase Value
Age Group
<=10                32             3.405000                108.96
11-14               54             2.900000                156.60
15-19              200             3.107800                621.56
20-24              325             3.020431                981.64
25-29               77             2.875584                221.42
30-34               52             2.994423                155.71
35-39               33             3.404545                112.35
40+                  7             3.075714                 21.53